Repository: BelfDev/digital_bank
Catalog: packages/localization/lib/src/l10n/app_*.arb
Languages: pt

# appTitle
source: Digital Bank
pt: Banco Digital

# welcomeSlogan
source: Your Money, Your Way, Digital.
pt: Sua Grana, Seu Jeito, Digital.

# welcomeFloatingButton
source: start application
pt: iniciar aplicação

# applicationFeedbackIntro
source: Your application number is...
pt: O número da sua aplicação é...

# applicationFeedbackNextStepDisclaimer
source: You can use this number to check the application status in our website.
pt: Você pode usar este número para verificar o status da sua aplicação no nosso site.

# applicationFeedbackFloatingButton
source: close
pt: fechar

# applicationFormAppBarTitle
source: New Application
pt: Nova Aplicação

# applicationFormBasicInfoSection
source: Basic Information
pt: Informações Básicas

# applicationFormPhotoInputHint
source: Your picture (liveliness check)
pt: Sua foto (liveliness check)

# applicationFormFirstNameInputHint
source: First Name
pt: Nome

# applicationFormLastNameInputHint
source: Last Name
pt: Sobrenome

# applicationFormBirthDateInputHint
source: Date of Birth
pt: Data de Nascimento

# applicationFormGenderInputHint
source: Gender
pt: Gênero

# applicationFormDependentsInfoSection
source: Dependents Information
pt: Dependentes

# applicationFormAddDependentButton
source: add dependent
pt: adicionar dependente

# applicationFormSubmitApplicationFloatingButton
source: submit application
pt: submeter aplicação

# validationFeedbackEmptyValue
source: value cannot be empty
pt: este campo não pode ficar vazio

# validationFeedbackInputLength
source: use less than 200 characters
pt: use menos que 200 caracteres

# validationFeedbackInvalidDate
source: invalid date
pt: data inválida

# applicationFeedbackCopiedCode
source: copied account number
pt: número da aplicação copiado

# applicationFormGenericApiErrorFeedback
source: Oops! Something went wrong. Please try again later.
pt: Oops! Algo deu errado. Por favor, tente novamente mais tarde.

# applicationFormServerApiErrorFeedback
source: Something went wrong on our side. Please try again later.
pt: Algo deu errado do nosso lado. Por favor, tente novamente mais tarde.

# applicationFormClientApiErrorFeedback
source: Please review your input and try again.
pt: Por favor reveja os dados inseridos e tente novamente.

# applicationFormMissingPhotoInputFeedback
source: Please take a picture for the liveliness check.
pt: Por favor tire uma foto para o livileness check.
